#Задача «Длина слова»
x = 12446575475;
print(len(str(x)));

#Задача «Суммы и разности»
a = 345;
b = 5757;
print(str(a+b), str(a-b));

#Задача «Среднее арифметическогое»
q = 6454;
w = 64634;
e = 34778;
print((q+w+e)//3);

#Задача «Простые строчки»
z = 'Понедельник';
v = 'Вторник';
print(v, ', ', z);

#Задача «Сложная формула»
g = 21;
p = 34;
l = 452;
print((((g * p) + (g * l))**3)/2);

